app/controllers/halls_controller.rb

SELECT `halls`.* FROM `halls` WHERE (name LIKE('%%')) ORDER BY created_at DESC
---
  def index
    @halls = Hall.includes(:user)

SELECT `values`.* FROM `values` WHERE `values`.`hall_id` = 1
---
  def show
    @value = Value.new
    @values = @hall.values.includes(:user)

INSERT INTO `halls` (`name`, `machine`, `data`, `user_id`, `created_at`, `updated_at`) VALUES ('ジアス', 'まどか', '１', 5, '2021-04-09 05:48:31.189503', '2021-04-09 05:48:31.189503')
---
  def create
    @hall = Hall.new(hall_params)
    if @hall.save

UPDATE `halls` SET `halls`.`event` = '①', `halls`.`updated_at` = '2021-04-03 00:49:39.362942' WHERE `halls`.`id` = 3
---
  def update
    if @hall.update(hall_params)

SELECT `halls`.* FROM `halls` WHERE `halls`.`id` = 1 LIMIT 1
DELETE FROM `halls` WHERE `halls`.`id` = 1
---
  def destroy
    hall = Hall.find(params[:id])
    hall.destroy

SELECT `halls`.* FROM `halls` WHERE `halls`.`id` = 1 LIMIT 1
---
  def set_hall
    @hall = Hall.find(params[:id])