app/controllers/values_controller.rb

INSERT INTO `values` (`text`, `user_id`, `hall_id`, `created_at`, `updated_at`) VALUES ('a', 1, 1, '2021-04-05 12:51:55.870942', '2021-04-05 12:51:55.870942')
---
  def create
    value = Value.create(value_params)